# vim: syntax=ruby filetype=ruby

tap 'homebrew/bundle'
tap 'homebrew/core'

# Install python, Go from DL sites, never from brew

brew 'git' # no force-bottle: git --exec-path doesn't work, remote helpers missing from path
brew 'jq'
brew 'neovim'
brew 'ruby'
brew 'openssl'
brew 'openssh'
brew 'starship'
brew 'tmux'
brew 'gitui'
brew 'age'
brew 'fish'

# Handy Utils
brew 'ripgrep'
brew 'fzf'
brew 'tree'
brew 'wget'
brew 'curl'
brew 'bat'
brew 'exa'
brew 'bottom'

# Git Utils
brew 'interactive-rebase-tool'
brew 'gnupg'
brew 'git-delta'
