# vim: syntax=ruby filetype=ruby

tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'ktr0731/evans'
tap 'filippo.io/age'
tap 'bufbuild/buf'

# Install python, Go from DL sites, never from brew

brew 'git' # no force-bottle: git --exec-path doesn't work, remote helpers missing from path
brew 'jq'
brew 'neovim'
brew 'ruby'
brew 'openssl'
brew 'openssh'
brew 'starship'
brew 'bottom'
brew 'tmux'
brew 'fish'
brew 'zoxide'
brew 'gitui'
brew 'age'
brew 'buf'

# Handy Utils
brew 'rg'
brew 'fzf'
brew 'tree'
brew 'curl'
brew 'wget'
brew 'bat'
brew 'exa'
brew 'evans' # gRPC for cURL

# Git Utils
brew 'git-interactive-rebase-tool'
brew 'gnupg'
brew 'git-delta'
